DataProcessors/ПометитьВСДНаУдаление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПометитьВСДНаУдаление</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатусыВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтатусыВСД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВСД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыВСД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиСистемыМеркурий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВСД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПометитьВСДНаУдаление/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПоменитьВСДДокументыНаУдаление() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВСДНаУдаление.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозвратныеВСД.ВСД КАК Ссылка
	|	ИЗ
	|		РегистрСведений.СтатусыВСД.СрезПоследних(
	|				ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -65),
	|				НЕ ВСД.ПометкаУдаления
	|					И ВСД.ТипВСД = ЗНАЧЕНИЕ(Справочник.ТипыВСД.ВозвратныйВСД)
	|					И (СтатусВСД = ЗНАЧЕНИЕ(Справочник.СтатусыВСД.Оформлен)
	|						ИЛИ СтатусВСД = ЗНАЧЕНИЕ(Справочник.СтатусыВСД.Аннулирован))) КАК ВозвратныеВСД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НеВозвратныеВСД.ВСД
	|	ИЗ
	|		РегистрСведений.СтатусыВСД.СрезПоследних(
	|				&ТекущаяДата,
	|				НЕ ВСД.ПометкаУдаления
	|					И ВСД.ТипВСД <> ЗНАЧЕНИЕ(Справочник.ТипыВСД.ВозвратныйВСД)
	|					И (СтатусВСД = ЗНАЧЕНИЕ(Справочник.СтатусыВСД.Оформлен)
	|						ИЛИ СтатусВСД = ЗНАЧЕНИЕ(Справочник.СтатусыВСД.Аннулирован))) КАК НеВозвратныеВСД) КАК ВСДНаУдаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыВСД.СрезПоследних(&ТекущаяДата, ) КАК СтатусыВСД
	|		ПО ВСДНаУдаление.Ссылка = СтатусыВСД.ВСД
	|ГДЕ
	|	СтатусыВСД.СтатусВСД <> ЗНАЧЕНИЕ(Справочник.СтатусыВСД.Оформлен)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПриходныеОперации.Ссылка
	//|ИЗ
	//|	Документ.ПриходныеОперации КАК ПриходныеОперации
	//|ГДЕ
	//|	НЕ ПриходныеОперации.ПометкаУдаления
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПриходныеОперацииСводно.Ссылка
	//|ИЗ
	//|	Документ.ПриходныеОперацииСводно КАК ПриходныеОперацииСводно
	//|ГДЕ
	//|	НЕ ПриходныеОперацииСводно.ПометкаУдаления
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.Регистратор
	//|ИЗ
	//|	РегистрСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций КАК ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций
	//|ГДЕ
	//|	ТИПЗНАЧЕНИЯ(ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.ДокументСсылка) = ТИП(Документ.ПриходныеОперации)
	|	";
	
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
		
	ДокументыНаУдаление = Запрос.Выполнить().Выбрать();
	
	Пока ДокументыНаУдаление.Следующий() Цикл
		ОбъектВСД = ДокументыНаУдаление.Ссылка.ПолучитьОбъект();
		ОбъектВСД.ПометкаУдаления = Истина;
		ОбъектВСД.Проведен = Ложь;
		ОбъектВСД.ОбменДанными.Загрузка = Истина;
		ОбъектВСД.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
